# Реализовать проект расчета суммарного расхода ткани на производство одежды.
# Основная сущность (класс) этого проекта — одежда, которая может иметь определенное название.
# К типам одежды в этом проекте относятся пальто и костюм. У этих типов одежды существуют параметры:
# размер (для пальто) и рост (для костюма). Это могут быть обычные числа: V и H, соответственно.
# Для определения расхода ткани по каждому типу одежды использовать формулы: для пальто (V/6.5 + 0.5),
# для костюма (2*H + 0.3). Проверить работу этих методов на реальных данных.
# Реализовать общий подсчет расхода ткани. Проверить на практике полученные на этом уроке знания:
# реализовать абстрактные классы для основных классов проекта, проверить на практике работу декоратора @property.

from abc import ABC, abstractmethod


class Clothes(ABC):
    @abstractmethod
    def need_cloth(self):
        pass


class Coat(Clothes):
    def __init__(self, size):
        self.size = size

    @property
    def need_cloth(self):
        return f"Потребуется {round(self.size / 6.5 + 0.5, 2)} ткани"


class Costume(Clothes):
    def __init__(self, growth):
        self.growth = growth

    @property
    def need_cloth(self):
        return f"Потребуется {self.growth * 2 + 0.3} ткани"


a = Costume(14)
b = Coat(175)
print(a.need_cloth)
print(b.need_cloth)
